{
  "/": "Дом",
  "/interesting": "Интересы",
  "/technology": "Стейк Техногологий",
  "/information": "Информация",
  "firmTitle1": "AET Groupe",
  "firmDescription1": "Работа в \"AET Groupe\" была началом моей карьеры в сфере IT. На тот момент у меня не было ни навыков, ни опыта, да, откровенно говоря, и знаний не хватало. В основном я выполнял самую простую работу. По большей части, это верстка, не обремененная сложными технологиями (HTML5, CSS3, JS). Я не умел работать с базами данных, не знал что такое СMS, шаблоны и пр. Поэтому все необходимые данные записывал в один объект и с помощью JS динамически отрисовывал страницу, устанавливал фильтры. Также я тогда не умел пользоваться разными библиотеками, поэтому приходилось писать анимацию (слайдеры, автоподгрузка) самому с нуля. Также мною была написана имитация корзины, работающая через LocalStarage, в которую можно было добавлять товары, и отправлять выбранное на email работодателя. Кроме этого верстал письма для HTML рассылки. Главной моей задачей на тот момент была разработка большого корпоративного сайта. Когда все страницы сайта были сверстаны, я начал ставить сайт на СMS. Выбором работодателя стала система MODX. В процессе работы познакомился с принципами работы CMS, установкой плагинов, реализацией мультиязычности. Но этому сайту так и не суждено было заменить старый. Ущел я на новую работу раньше, чем начальство одобрило замену сайта.",
  "firmTitle2": "Webmatrix",
  "firmDescription2": "Работа в вебстудии \"Webmatrix\" требовала намного больших знаний, нежели в предыдущей компании. Там я научился создавать интернет магазины, отточил навыки верстки до автоматизма, познакомился с правилами XHR запросов. В основном здесь мне приходилось работать с системой opencart. Так же здесь я научился активно использовать и редактировать плагины, менять шаблоны и переносить товары из одной базы данных MYSQL в другую. Но чем больше я там работал, тем отчетлевее понимал, что конвеер по созданию сайтов - это не то, к чему я стремился, делая первые шаги по изучению языков программирования. Я мечтал создавать сложные проекты, использовать передовые технологии, работать в команде проффессиональных разработчиков. Здесь же мне не давали выйти за пределы стандартных CMS на базе PHP. Осознание бесперспективности в плане личностного роста дали мотивацию к дальнейшему поиску более подходящей работы.",
  "firmTitle3": "Business Solution LTD",
  "firmDescription3": "В компании \"Business Solution LTD\" основной моей задачей было поддержание сложной системы, использующей разные технологии. Система представляла собой CRM, написанной на фреймворке \"Laravel\", основной сайт, поставленный на WordPress, и платформы на Angular 2. До этого я не только не знал эти технологии, но и в принципе плохо представлял себе, что такое фреймворк, и как на нем можно создавать сайты и программы. Здесь я познакомился с тем, что такое Router, и как с ним работать. Как создавать шаблоны для страниц. Также освоил методы аутентификации через логин - пароль и через соцсети. Кроме того осуществлял интеграцию с платежной системой, подключал систему афилятов. Т.е. чтобы клиент мог заполнить форму регистрации на стороннем сайте партнера и автоматически регистрировался в CRM. Вместе с этим там осуществлялся трекинг, с помощью которого можно было проследить, от какого партнера сколько клиентов пришло. Также познакомился с програмой-сборщиком Webpack, и с тем как компилировать и собирать JS, SASS. Изучил, как писать асинхронные функции в JS, что такое Callback, как работают промисы и async await. Эта работа была и перспективной и полезной в плане профессионального роста, но она имела огромный минус: во всех проектах использовался язык PHP. Сердце мое лежало к языку Java Script. Уже тогда, когда у меня появлялась свободная минутка, я изучал React JS, и это мне очень пригодилось на следующей работе.",
  "firmTitle4": "Software Business Technology",
  "firmDescription4": "Когда я устроился в \"Software Business Technology\", я уже многое знал и умел. Нанимали меня как WordPress разработчика. Но за пару месяцев я закрыл все задачи по пяти различным сайтам компании. Работа заключалась в добавлении новых блоков с информацией, а так же доработкой плагинов, оптимизацией и SEO-продвижением. После этого меня направили на проект, написанный на ReactJS. По сути это агрегатор магазинов со сложной структурой. Написан он с использованием Redux, GraphQL, и еще множеством разных библиотек. До этого я всегда был единственным разработчиком в доверенной мне области. Здесь же я научился работать в команде, освоил систему управления версиями GIT, изучил ReactJS, Redux. Кроме того самостоятельно изучал как создавать сервер на NodeJS, как работать с Material UI, MongoDB, EmberJS.",
  "firmTitle5": "ITransition",
  "firmDescription5": "В компании \"ITransition\" я занимался разработкой нескольких проектов. В одном из них разработка велась на Typescript с использованием Material UI и Redux Saga. Другим проектом было мобильное приложение, написанное на React-native. Со всеми этими технологиями я был знаком лишь поверхностно. Тем не менее я быстро освоился, и стал работоспособной единицей команды.",
  "periodOfWork": "Период: ",
  "period1": "Ноябрь 2015 - Февраль 2016",
  "period2": "Февраль 2016 - Сентябрь 2016",
  "period3": "Сентябрь 2016 - Январь 2017",
  "period4": "Январь 2017 - Июнь 2019",
  "period5": "Июнь 2019 до настоящего времени",
  "learnedTechnology": "Освоенные технологии: ",
  "jsTitle": "Java Script",
  "reactTitle": "React JS",
  "reduxTitle": "Redux",
  "matherialTitle": "Matherial UI",
  "nodeTitle": "Node JS",
  "graphQLTitle": "Graph QL",
  "wordPressTitle": "WordPress",
  "jsDescription": "Манипулирования с ДОМ деревом. Поиск элементов, обработка событий, добавление и удаление классов элементам. Создание слайдеровБ сложных структур типа рисунка со сравнением. Написание валидаций для форм, отправка AJAX запросов и обработка ответов.",
  "reactDescription": "Поддержание проектов, исправление багов, разработка нового функционала. Работа с Typescript, использование хуков, подключение библиотек. Опыт работы с React-native.",
  "reduxDescription": "Использование Redux в проектах. Работа с Redux-Saga.",
  "matherialDescription": "Разработка проектов с использованием дизайна Material UI. Верстка по макетам.",
  "nodeDescription": "Написание простых серверов на Node JS. Подключение к базам данных (PostgreSQL, MongoDB). Аутентификация. Использование Express, Koa.",
  "graphQLDescription": "Отправка запросов и обработка ответов с использованием GraphQL. Использование Apollo Client.",
  "wordPressDescription": "Создание и редактирование сайтов с использованием CMS WordPress. Редактирование плагинов в соответствии с нуждами заказчика.",
  "jsPeriod": "4 года",
  "reactPeriod": "3 года",
  "reduxPeriod": "3 года",
  "matherialPeriod": "1 год",
  "nodePeriod": "2 года",
  "graphQLPeriod": "2 года",
  "wordPressPeriod": "2 года",
  "name": "Струбицкий Андрей",
  "phoneTitle": "Телефон",
  "skypeTitle": "Skype",
  "telegramTitle": "Telegram",
  "emailTitle": "Электронная почта",
  "literatureTitle": "Литература",
  "literatureDiscription": "В литературе отдаю предпочтение жанру фетнтези, приключениям и историческим романам. В свое время сам пробовал браться за перо, но мои книги так нигде и не были опубликованы. Сам писал в жанре фентези, также сочиняю стихи.",
  "musicTitle": "Музыка",
  "musicDiscription": "Пребпочитаю слушать рок, но не брезгую и другими направлениями в музыке. Играю на гитаре, правда весьма посредственно. Сказывается отсутствие времени на тренировки.",
  "sportTitle": "Спорт",
  "sportDiscription": "Сидячий образ жизни может привести к серьезным проблемам с серцем и суставами в довольно раннем возрасте. Во избежание последствий по выходным активно занимаюсь спортом. Предпочитаю занятия на перекладине, бег, езду на велосипеде.",
  "gamesTitle": "Видео Игры",
  "gamesDiscription": "В школьные и студенческие годы много времени уделял видеоиграм. Меня всегда больше привлекали стратегии. Из любимых игр могу назвать Warcraft3, Starcraft Broodwar, Heroes of might and magic 3, Diablo2, Сivilization4.",
  "developmentTitle": "Программирование",
  "developmentDiscription": "Как говорится, остановка в развитии - это шаг назад. Особенно остро это ощущается в последнее время, когда технологии развиваются ошеломляющими темпами. Любому разработчику необходимо развиваться, чтобы быть конкурентоспособным на рынке.",
  "historyTitle": "История",
  "historyDiscription": "Увлекаюсь историей. Взгляд в прошлое многое объясняет многие вещи в настоящем. Особенно интересен период СССР, поскольку именно оттуда вытекает та политическая и экономическая ситуация, в которой мы сейчас находимся.",
  "footerTitle": "2019 ©. Все права защищены.",
  "footerContentPath1": "Этот сайт предназначен для свободного просмотра работодателей. Любые попытки копирования сайта для своих корыстных целей будут признаны безнравственными и неуважительными по отношению к автору.",
  "footerContentPath2": "Если после просмота данного сайта у вас остались какие-либо вопросы, вы можете связаться со мной по телефону, указанному в разделе \"Контакты\", либо написать письмо по электронной почте. Готов рассмотреть любые предложения."
}
