{
  "/": "Дом",
  "/interesting": "Інтарэсы",
  "/technology": "Стэйк Техногологий",
  "/contacts": "Кантакты",
  "firmTitle1": "AET Groupe",
  "firmDescription1": "Праца ў \"AET Groupe\" была пачаткам маёй кар'еры ў сферы IT. На той момант у мяне не было ні навыкаў, ні досведу, ды, шчыра кажучы, і ведаў не хапае. У асноўным я выконваў самую простую працу. Па большай частцы, гэта вёрстка, не абцяжараная складанымі тэхналогіямі (HTML5, CSS3, JS). Я не ўмеў працаваць з базамі дадзеных, не ведаў што такое СMS, шаблоны і інш. Таму ўсе неабходныя дадзеныя запісваў у адзін аб'ект і з дапамогай JS дынамічна малююць старонку, усталёўваў фільтры. Таксама я тады не ўмеў карыстацца рознымі бібліятэкамі, таму даводзілася пісаць анімацыю (слайдары, автоподгрузка) самому з нуля. Таксама мною была напісана імітацыя кошыка, якая працуе праз LocalStarage, у якую можна было дадаваць тавары, і адпраўляць абранае на email працадаўцы. Акрамя гэтага вярстаўся лісты для HTML рассылання. Галоўнай маёй задачай на той момант была распрацоўка вялікага карпаратыўнага сайта. Калі ўсе старонкі сайта былі складзены, я пачаў ставіць сайт на СMS. Выбарам працадаўцы стала сістэма MODX. У працэсе працы пазнаёміўся з прынцыпамі працы CMS, устаноўкай убудоў, рэалізацыяй Мультымоўнае. Але гэтага сайту так і не наканавана было замяніць стары. Цясніну я на новую працу раней, чым начальства ухваліў замену сайта.",
  "firmTitle2": "Webmatrix",
  "firmDescription2": "Праца ў вебстудии \"Webmatrix\" патрабавала нашмат большых ведаў, чым у папярэдняй кампаніі. Там я навучыўся ствараць інтэрнэт крамы, адтачыў навыкі вёрсткі да аўтаматызму, пазнаёміўся з правіламі XHR запытаў. У асноўным тут мне даводзілася працаваць з сістэмай opencart. Гэтак жа тут я навучыўся актыўна выкарыстоўваць і рэдагаваць убудовы, мяняць шаблоны і пераносіць тавары з адной базы дадзеных MYSQL ў іншую. Але чым больш я там працаваў, тым отчетлевее разумеў, што канвеер па стварэнні сайтаў - гэта не тое, да чаго я імкнуўся, робячы першыя крокі па вывучэнні моў праграмавання. Я марыў ствараць складаныя праекты, выкарыстоўваць перадавыя тэхналогіі, працаваць у камандзе проффессиональных распрацоўшчыкаў. Тут жа мне не давалі выйсці за межы стандартных CMS на базе PHP. Ўсведамленне бесперспектыўнасці ў плане асобаснага росту далі матывацыю да далейшага пошуку больш прыдатнай працы.",
  "firmTitle3": "Business Solution LTD",
  "firmDescription3": "У кампаніі \"Business Solution LTD\" асноўнай маёй задачай было падтрыманне складанай сістэмы, якая выкарыстоўвае розныя тэхналогіі. Сістэма ўяўляла сабой CRM, напісанай на фреймворке \"Laravel\", асноўны сайт, пастаўлены на WordPress, і платформы на Angular 2. Да гэтага я не толькі не ведаў гэтыя тэхналогіі, але і ў прынцыпе дрэнна ўяўляў сабе, што такое фреймворк, і як на ім можна ствараць сайты і праграмы. Тут я пазнаёміўся з тым, што такое Router, і як з ім працаваць. Як ствараць шаблоны для старонак. Таксама асвоіў метады аўтэнтыфікацыі праз лагін - пароль і праз сацсеткі. Акрамя таго ажыццяўляў інтэграцыю з аплатнай сістэмай, падключаў сістэму афилятов. Г.зн. каб кліент мог запоўніць форму рэгістрацыі на пабочным сайце партнёра і аўтаматычна рэгістраваўся ў CRM. Разам з гэтым там ажыццяўляўся трэкінг, з дапамогай якога можна было прасачыць, ад якога партнёра колькі кліентаў прыйшло. Таксама пазнаёміўся з програма-зборшчыкам Webpack, і з тым як кампіляваць і збіраць JS, SASS. Вывучыў, як пісаць асінхронныя функцыі ў JS, што такое Callback, як працуюць Промісу і async await. Гэтая праца была і перспектыўнай і карыснай у плане прафесійнага росту, але яна мела велізарны мінус: ва ўсіх праектах выкарыстоўваўся мова PHP. Сэрца маё ляжала да мовы Java Script. Ужо тады, калі ў мяне з'яўлялася вольная хвілінка, я вывучаў React JS, і гэта мне вельмі спатрэбілася на наступным працы.",
  "firmTitle4": "Software Business Technology",
  "firmDescription4": "Калі я уладкаваўся ў \"Software Business Technology\", я ўжо шмат што ведаў і ўмеў. Наймалі мяне як WordPress распрацоўніка. Але за пару месяцаў я зачыніў усе задачы па пяці розных сайтаў кампаніі. Праца заключалася ў даданні новых блокаў з інфармацыяй, а так жа дапрацоўкай убудоў, аптымізацыяй і SEO-прасоўваннем. Пасля гэтага мяне накіравалі на праект, напісаны на ReactJS. Па сутнасці гэта агрэгатар магазінаў са складанай структурай. Напісаны ён з выкарыстаннем Redux, GraphQL, і яшчэ мноствам розных бібліятэк. Да гэтага я заўсёды быў адзіным распрацоўшчыкам ў даверанай мне вобласці. Тут жа я навучыўся працаваць у камандзе, асвоіў сістэму кіравання версіямі GIT, вывучыў ReactJS, Redux. Акрамя таго самастойна вывучаў як ствараць сервер на NodeJS, як працаваць з Material UI, MongoDB, EmberJS.",
  "firmTitle5": "ITransition",
  "firmDescription5": "У кампаніі \"ITransition\" я займаўся распрацоўкай некалькіх праектаў. У адным з іх распрацоўка вялася на Typescript з выкарыстаннем Material UI і Redux Saga. Іншым праектам было мабільнае прыкладанне, напісанае на React-native. З усімі гэтымі тэхналогіямі я быў знаёмы толькі павярхоўна. Тым не менш я хутка асвойтаўся, і стаў працаздольнай адзінкай каманды.",
  "periodOfWork": "Перыяд: ",
  "period1": "Лістапада 2015 - Лютага 2016",
  "period2": "Лютага 2016 - Верасень 2016",
  "period3": "Верасень 2016 - Студзень 2017",
  "period4": "Студзень 2017 - Чэрвень 2019",
  "period5": "Чэрвень 2019 да цяперашняга часу",
  "learnedTechnology": "Асвоеныя тэхналогіі: ",
  "jsTitle": "Java Script",
  "reactTitle": "React JS",
  "reduxTitle": "Redux",
  "matherialTitle": "Matherial UI",
  "nodeTitle": "Node JS",
  "graphQLTitle": "Graph QL",
  "wordPressTitle": "WordPress",
  "jsDescription": "Маніпулявання з ДОМ дрэвам. Пошук элементаў, апрацоўка падзей, даданне і выдаленне класаў элементам. Стварэнне слайдеровБ складаных структур тыпу малюнка з параўнаннем. Напісанне валідацыю для формаў, адпраўка AJAX запытаў і апрацоўка адказаў.",
  "reactDescription": "Падтрыманне праектаў, выпраўленне багаў, распрацоўка новага функцыяналу. Праца з Typescript, выкарыстанне хуков, падключэнне бібліятэк. Досвед працы з React-native.",
  "reduxDescription": "Использование Redux в проектах. Работа с Redux-Сага.",
  "matherialDescription": "Распрацоўка праектаў з выкарыстаннем дызайну Material UI. Верстка па макетам.",
  "nodeDescription": "Напісанне простых сервераў на Node JS. Падключэнне да баз дадзеных (PostgreSQL, MongoDB). Аўтэнтыфікацыя. Выкарыстанне Express, Koa.",
  "graphQLDescription": "Адпраўка запытаў і апрацоўка адказаў з выкарыстаннем GraphQL. Выкарыстанне Apollo Client.",
  "wordPressDescription": "WordPress Description",
  "jsPeriod": "4 гады",
  "reactPeriod": "3 гады",
  "reduxPeriod": "3 гады",
  "matherialPeriod": "1 год",
  "nodePeriod": "2 гады",
  "graphQLPeriod": "2 гады",
  "wordPressPeriod": "2 гады",
  "name": "Струбіцкі Андрэй",
  "phoneTitle": "Тэлефон",
  "skypeTitle": "Skype",
  "telegramTitle": "Telegram",
  "emailTitle": "Электронная пошта",
  "literatureTitle": "Літаратура",
  "literatureDiscription": "У літаратуры аддаю перавагу жанру фетнтези, прыгодам і гістарычным раманам. У свой час сам спрабаваў брацца за пяро, але мае кнігі так нідзе і не былі апублікаваныя. Сам пісаў у жанры фэнтэзі, таксама складаю вершы.",
  "musicTitle": "Музыка",
  "musicDiscription": "Пребпочитаю слухаць рок, але не грэбую і іншымі напрамкамі ў музыцы. Гуляю на гітары, праўда вельмі пасрэдна. Адбіваецца адсутнасць часу на трэніроўкі.",
  "sportTitle": "Спорт",
  "sportDiscription": "Сядзячы лад жыцця можа прывесці да сур'ёзных праблем з Серце і суставамі ў даволі раннім узросце. Каб пазбегнуць наступстваў па выхадных актыўна займаюся спортам. Аддаю перавагу заняткі на перакладзіне, бег, язду на ровары.",
  "gamesTitle": "Відэа Гульні",
  "gamesDiscription": "У школьныя і студэнцкія гады шмат часу надаваў відэагульням. Мяне заўсёды больш прыцягвалі стратэгіі. З любімых гульняў магу назваць Warcraft3, Starcraft Broodwar, Heroes of might and magic 3, Diablo2, Сivilization4.",
  "developmentTitle": "Праграмаванне",
  "developmentDiscription": "Як гаворыцца, прыпынак у развіцці - гэта крок назад. Асабліва востра гэта адчуваецца ў апошні час, калі тэхналогіі развіваюцца ашаламляльнымі тэмпамі. Любому распрацоўніку неабходна развівацца, каб быць канкурэнтаздольным на рынку.",
  "historyTitle": "Гісторыя",
  "historyDiscription": "Захапляюся гісторыяй. Погляд у мінулае шмат што тлумачыць многія рэчы ў сучаснасці. Асабліва цікавы перыяд СССР, паколькі менавіта адтуль выцякае тая палітычная і эканамічная сітуацыя, у якой мы цяпер знаходзімся.",
  "footerTitle": "2019 ©. Ўсе правы абаронены.",
  "footerContentPath1": "Гэты сайт прызначаны для свабоднага прагляду працадаўцаў. Любыя спробы капіявання сайта для сваіх карыслівых мэтаў будуць прызнаныя амаральнымі і непаважліва ў адносінах да аўтара.",
  "footerContentPath2": "Калі пасля просмота дадзенага сайта ў вас засталіся якія-небудзь пытанні, вы можаце звязацца са мной па тэлефоне, паказанаму ў раздзеле \"Кантакты\", альбо напісаць ліст па электроннай пошце. Гатовы разгледзець любыя прапановы."
}
