{
  "/": "Home",
  "/interesting": "Interesting",
  "/technology": "Steak of technologies",
  "/contacts": "Information",
  "/interesting/": "Interesting",
  "/technology/": "Steak of technologies",
  "/contacts/": "Information",
  "firmTitle1": "AET Groupe",
  "firmDescription1": "Working at \"AET Groupe\" was the beginning of my IT career. At that time I didn’t have the skills or the experience, but frankly, I didn’t have enough knowledge. Basically, I did the simplest work. For the most part, this is a layout that is not burdened with complex technologies (HTML5, CSS3, JS). I didn’t know how to work with databases, didn’t know what CMS is, templates, etc. Therefore, I wrote down all the necessary data into one object and, using JS, dynamically rendered the page, installed filters. Also, I did not know how to use different libraries, so I had to write animation (sliders, automatic loading) from scratch myself. I also wrote an imitation of the basket, working through LocalStarage, in which you could add products, and send the selected email to the employer. In addition, the letter version for HTML mailing. My main task at that time was the development of a large corporate website. When all pages of the site were put together, I began to put the site on CMS. The employer’s choice was the MODX system. In the process of work I got acquainted with the principles of CMS, installation of plug-ins, the implementation of multilingual. But this site was never destined to replace the old one. I added to the new job before the authorities approved the replacement site.",
  "firmTitle2": "Webmatrix",
  "firmDescription2": "Work in web studio \"Webmatrix\" required much more knowledge than in the previous company. There I learned how to create online stores, perfected the layout skills to automatism, got acquainted with the rules of XHR queries. Basically here I had to work with the opencart system. Also here I learned how to actively use and edit plug-ins, change templates and transfer products from one MYSQL database to another. But the more I worked there, the more I realized that the pipeline for creating websites is not what I sought, taking the first steps in the study of programming languages. I dreamed of creating complex projects, using advanced technologies, working with a team of professional developers. Here, I was not allowed to go beyond the standard CMS based on PHP. The realization of hopelessness in terms of personal growth gave motivation for the further search for a more suitable job.",
  "firmTitle3": "Business Solution LTD",
  "firmDescription3": "In the company \"Business Solution LTD\" my main task was to maintain a complex system using different technologies. The system was a CRM, written on the \"Laravel\" framework, the main site built on WordPress, and the platform on Angular 2. Before that, I not only didn’t know these technologies, but in principle had a bad idea of ​​what a framework was and how you can create websites and programs on it. Here I got to know what a Router is and how to work with it. How to create templates for pages. I also mastered authentication methods through login - password and through social networks. In addition, I integrated with the payment system, connected the system of affiliates. Those. so that the client can fill out the registration form on a third-party partner site and automatically registered in CRM. At the same time, tracking was carried out there, with the help of which it was possible to track from which partner how many clients came. Also I got acquainted with the Webpack collector program and how to compile and build JS, SASS. I learned how to write asynchronous functions in JS, what Callback is, how promises and async await work. This work was both promising and useful in terms of professional growth, but it had a huge disadvantage: all projects used the PHP language. My heart was to the language of Java Script. Already when I had free time, I studied React JS, and this was very useful for me at my next job.",
  "firmTitle4": "Software Business Technology",
  "firmDescription4": "When I settled in the \"Software Business Technology\", I already knew a lot and knew how. Hired me as a WordPress developer. But in a couple of months I closed all the tasks on five different company sites. My job was to add new blocks with information, as well as refinement of plug-ins, optimization and SEO-promotion. After that, I was sent to a project written in ReactJS. In fact, it is an aggregator of stores with a complex structure. It is written using Redux, GraphQL, and many more different libraries. Before that, I was always the only developer in the field entrusted to me. Here I learned to work in a team, I mastered the GIT version control system, studied ReactJS, Redux. In addition, I independently studied how to create a server on NodeJS, how to work with Material UI, MongoDB, EmberJS.",
  "firmTitle5": "ITransition",
  "firmDescription5": "At \"ITransition\", I was involved in the development of several projects. In one of them, development was conducted on Typescript using Material UI and Redux Saga. Another project was a mobile application written in React-native. I was only superficially familiar with all these technologies. Nevertheless, I quickly got used to it, and became a workable unit of the team.",
  "periodOfWork": "Period: ",
  "period1": "November 2015 - February 2016",
  "period2": "February 2016 - September 2016",
  "period3": "September 2016 - January 2017",
  "period4": "January 2017 - June 2019",
  "period5": "June 2019 until now",
  "learnedTechnology": "Has learned to work: ",
  "jsTitle": "Java Script",
  "reactTitle": "React JS",
  "reduxTitle": "Redux",
  "matherialTitle": "Matherial UI",
  "nodeTitle": "Node JS",
  "graphQLTitle": "Graph QL",
  "wordPressTitle": "WordPress",
  "jsDescription": "Manipulating with a tree house. Search for items, handle events, add and remove classes for items. Creating sliders for complex structures like drawing with comparison. Writing validations for forms, submitting AJAX requests and processing responses.",
  "reactDescription": "Maintaining projects, fixing bugs, developing new functionality. Working with Typescript, using hooks, connecting libraries. Experience with React-native.",
  "reduxDescription": "Using Redux in projects. Work with Redux-Saga.",
  "matherialDescription": "Development of projects using Material UI design. Nesting on the layout.",
  "nodeDescription": "Writing a simple server on Node JS. Connecting to databases (PostgreSQL, MongoDB). Authentication. Using Express, Koa.",
  "graphQLDescription": "Submitting requests and processing responses using GraphQL. Using Apollo Client.",
  "wordPressDescription": "Creation and editing sites using CMS WordPress. Editing plugins according to customer needs.",
  "jsPeriod": "4 years",
  "reactPeriod": "3 years",
  "reduxPeriod": "3 years",
  "matherialPeriod": "1 year",
  "nodePeriod": "2 years",
  "graphQLPeriod": "2 years",
  "wordPressPeriod": "2 years",
  "name": "Strubitskiy Andrey",
  "phoneTitle": "Phone",
  "skypeTitle": "Skype",
  "telegramTitle": "Telegram",
  "emailTitle": "Email",
  "literatureTitle": "Literature",
  "literatureDiscription": "In literature, I prefer the genre of fettzi, adventure and historical novels. At one time, he tried to take up a pen, but my books were never published anywhere. He himself wrote in the fantasy genre, I also compose poems.",
  "musicTitle": "Music",
  "musicDiscription": "I prefer to listen to rock, but I do not disdain other directions in music. I play the guitar, though very mediocre. Affects the lack of time for training.",
  "sportTitle": "Sport",
  "sportDiscription": "A sedentary lifestyle can lead to serious problems with the heart and joints at a fairly early age. In order to avoid consequences on the weekends I am actively engaged in sports. I prefer classes on the crossbar, running, cycling.",
  "gamesTitle": "Video Games",
  "gamesDiscription": "In school and student years, he devoted a lot of time to video games. I have always been more attracted to strategies. My favorite games are Warcraft3, Starcraft Broodwar, Heroes of might and magic 3, Diablo2, Civilization4.",
  "developmentTitle": "Programming",
  "developmentDiscription": "As they say, a halt in development is a step back. This has been especially acute lately, when technologies are developing at a staggering pace. Any developer needs to develop in order to be competitive in the market.",
  "historyTitle": "History",
  "historyDiscription": "I am fond of history. A look into the past explains a lot of things in the present. The period of the USSR is especially interesting, since it is from there that the political and economic situation that we are currently in is flowing.",
  "footerTitle": "2019 ©. All rights reserved.",
  "footerContentPath1": "This site is designed for free viewing of employers. Any attempt to copy the site for their own selfish purposes will be considered immoral and disrespectful to the author.",
  "footerContentPath2": "If after seeing this site you have any questions, you can contact me by phone, indicated in the \"Contacts\" section, or write a letter by e-mail. I am ready to consider any proposals."
}
